OpenFOAM/testCase/st0_40/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs
(
    "liboverset.so"
    "libfishBodyMotion.so"
);

DebugSwitches
{
    overset                 0; 	//0 off - 1 give more information
    dynamicOversetFvMesh    0;
    cellVolumeWeight        0;
    inverseDistance	        0;	//2 Force dumping of cellInterpolationWeight
}



application     overPimpleDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;
//stopAt          writeNow;

// endTime         3.5;
// deltaT          0.05;
// purgeWrite      0;
endTime         42.5;
deltaT          1e-06;
purgeWrite      5;

writeControl    timeStep;

writeInterval   100;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

adjustTimeStep  yes;
maxCo           0.9;
maxDeltaT       0.1;



// ************************************************************************* //


functions
{

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

	wing_top
    {
		type forces;
		libs ("libforces.so");

		//writeControl outputTime;
		writeControl   timeStep;
		writeInterval   1;

		//// Patches to sample
		//patches ("body1" "body2" "body3");
		patches (wingTop);

		//// Name of fields
		pName p;
		Uname U;

		//// Density
		rho rhoInf;
		rhoInf 1026.021;

		//// Centre of rotation
		CofR (0.25 0 0);

		// Spatial data binning
		// - extents given by the bounds of the input geometry
		binData
		{
			nBin        20;
			direction   (1 0 0);
			cumulative  no;
		}
    }

	wing_bottom
    {
		type forces;
		libs ("libforces.so");

		//writeControl outputTime;
		writeControl   timeStep;
		writeInterval   1;

		//// Patches to sample
		//patches ("body1" "body2" "body3");
		patches (wingBottom);

		//// Name of fields
		pName p;
		Uname U;

		//// Density
		rho rhoInf;
		rhoInf 1026.021;

		//// Centre of rotation
		CofR (0.25 0 0);

		// Spatial data binning
		// - extents given by the bounds of the input geometry
		binData
		{
			nBin        20;
			direction   (1 0 0);
			cumulative  no;
		}
    }

	forces_total
    {
		type forces;
		libs ("libforces.so");

		//writeControl outputTime;
		writeControl   timeStep;
		writeInterval   1;

		//// Patches to sample
		//patches ("body1" "body2" "body3");
		patches ("wing.*");

		//// Name of fields
		pName p;
		Uname U;

		//// Density
		rho rhoInf;
		rhoInf 1026.021;

		//// Centre of rotation
		CofR (0.25 0 0);
    }
};

