OpenFOAM/testCase/st0_40/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    oversetPatch
    {
        type            overset;
        value           uniform 0;
    }

    "wing.*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    #include "include/frontBackTopBottomfreePatches"

    inlet
    {
        type    zeroGradient;
    }

    outlet
    {
        type    zeroGradient;
    }
}

// ************************************************************************* //
