OpenFOAM/testCase/st0_40/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
		minIter 		2;
    }

    pFinal
    {
        $p;
        relTol          0;
		minIter 		2;
    }


    yPsi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.0;
    }

    "(U|k|epsilon|omega)"
    {
/*
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
		minIter 	2;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
		minIter 		2;
    }
}

PIMPLE
{
    momentumPredictor   true;
    correctPhi          false; 
    oversetAdjustPhi    false;
    nOuterCorrectors    1;
    nCorrectors         4;
    nNonOrthogonalCorrectors 1;
    checkMeshCourantNo  true;

    ddtCorr             true;

    residualControl
    {
        "(p|U|k|omega|epsilon)"
        {
            tolerance 5e-5;
            relTol 0;
        }
    }

}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"           1;
    }
}

// ************************************************************************* //
